Repository: sultan-algarbi-paylink/paylink-woocommerce-plugin
Catalog: languages/paylink-*.po
Languages: ar

source: APP ID
ar: معرف التطبيق (App Id)

source: Card Brands
ar: بطاقات الدفع المتاحة

source: Description
ar: وصف بوابة الدفع

source: Display Thank you page
ar: عرض صفحة الشكر

source: Display a Thank you page before redirecting to the Paylink payment page.
ar: عرض صفحة الشكر قبل توجيه المستخدم إلى صفحة الدفع Paylink.

source: Empty response received from Paylink API while adding invoice.
ar: تم استلام استجابة فارغة من Paylink أثناء إضافة الفاتورة.

source: Empty response received from Paylink API while authenticating.
ar: تم استلام استجابة فارغة من Paylink أثناء المصادقة.

source: Empty response received from Paylink API while getting invoice.
ar: تم استلام استجابة فارغة من Paylink أثناء استيراد معلومات الفاتورة.

source: Enable/Disable
ar: تمكين/تعطيل

source: Enable Paylink Payment Gateway
ar: تمكين بوابة الدفع Paylink

source: Enable Test Mode
ar: تمكين وضع الاختبار

source: Error:
ar: خطأ:

source: Failed Payment Message
ar: رسالة فشل عملية الدفع

source: Failed to add invoice to Paylink API. Status Code:
ar: فشلت عملية إرسال الفاتورة إلى نظام Paylink. رمز الحالة:

source: Failed to authenticate with Paylink API. Status Code:
ar: يوجد خطأ في مفاتيح الربط مع Paylink. رمز الحالة:

source: Failed to authenticate with the Paylink API!
ar: يوجد خطأ في مفاتيح الربط مع Paylink!

source: Failed to connect to the Paylink API. Please try again later.
ar: فشل الاتصال بـ Paylink API. يرجى المحاولة مرة أخرى في وقت لاحق.

source: Failed to get invoice from Paylink API. Status Code:
ar: فشلت عملية استيراد معلومات الفاتورة من Paylink. رمز الحالة:

source: Instructions
ar: رسالة التحويل لبوابة الدفع

source: Instructions that will be added to the thank you page.
ar: سوف يتم عرض هذه الرسالة قبل تحويل العميل إلى صفحة الدفع في Paylink.

source: No URL found in the Paylink API response
ar: لم يتم العثور على عنوان URL في بيانات الفاتورة المستوردة من Paylink API

source: No authentication token found in the response from Paylink API.
ar: لم يتم العثور على رمز مصادقة في الاستجابة من Paylink API.

source: No order ID found in the request!
ar: لم يتم العثور على معرف الطلب (Order ID)!

source: No order status found in the Paylink API response
ar: لم يتم العثور على حالة الطلب (order status) في معلومات الطلب المستوردة من Paylink API

source: No transaction number found in the request!
ar: لم يتم العثور على رقم المعاملة في الطلب!

source: Order ID is missing!
ar: معرف الطلب مفقود!

source: Order not found!
ar: الطلب غير موجود!

source: Paylink Payment Gateway
ar: بوابة الدفع Paylink

source: Paylink Transaction Number
ar: رقم معاملة Paylink

source: Paylink payment gateway for WooCommerce, It provides your customers with the popular payment methods in the Kingdom of Saudi Arabia, such as
ar: بوابة الدفع Paylink لـ WooCommerce، توفر لعملائك طرق الدفع الشائعة في المملكة العربية السعودية، مثل

source: Payment not completed yet!
ar: لم يتم إكمال الدفع بعد!

source: Place the payment gateway in test mode.
ar: وضع بوابة الدفع في وضع الاختبار.

source: Seamless transactions with popular payment methods in the Kingdom of Saudi Arabia, including:
ar: معاملات سلسة باستخدام طرق الدفع الشائعة في المملكة العربية السعودية، بما في ذلك:

source: Secret Key
ar: المفتاح السري (Secret Key)

source: Test Mode
ar: وضع الاختبار

source: Test Mode is enabled.
ar: تم تمكين وضع الاختبار.

source: Thank you for your order, you will be redirected to Paylink payment page.
ar: شكرًا لطلبك، سيتم توجيهك إلى صفحة الدفع Paylink.

source: Thank you for your order. Please complete your payment using the payment button below.
ar: شكرًا لطلبك. يرجى إكمال الدفع باستخدام زر الدفع أدناه.

source: The card brands to use for the payment. Separate the brands with a comma. Valid brands are:
ar: بطاقات الدفع المسموح بها، افصل بين العلامات بفاصلة. القيم المتاحة هي:

source: This controls the description which the user sees during checkout.
ar: يتحكم هذا في الوصف الذي يراه المستخدم أثناء الدفع.

source: This controls the error message that appears to the user if the payment fails.
ar: يتحكم هذا في رسالة الخطأ التي تظهر للمستخدم إذا فشل الدفع.

source: This controls the title which the user sees during checkout.
ar: يتحكم هذا في العنوان الذي يراه المستخدم أثناء الدفع.

source: This is the APP ID provided by Paylink.
ar: هذا هو معرف التطبيق المقدم من Paylink.

source: This is the URL where Paylink will send the payment status callback.
ar: هذا هو العنوان URL الذي سترسل Paylink إليه استدعاء حالة الدفع.

source: This is the secret key provided by Paylink.
ar: هذا هو المفتاح السري المقدم من Paylink.

source: Title
ar: اسم وسيلة الدفع

source: Transaction number is missing!
ar: رقم المعاملة مفقود!

source: Unable to send authentication request: API ID or secret key is missing. Please provide the required credentials to proceed.
ar: تعذر إرسال طلب المصادقة: (App ID) أو (Secret Key) مفقود. يرجى توفير بيانات الاعتماد المطلوبة للمتابعة.

source: Visa/Mastercard
ar: فيزا/ماستركارد

source: WC Payment Gateway class does not exist. WooCommerce is not installed.
ar: لم يتم تثبيت إضافة WooCommerce. يجب أن يتم تثبيت الإضافة لتتمكن من استخدام بوابة الدفع بالشكل الصحيح.

source: WooCommerce is not installed.
ar: لم يتم تثبيت إضافة WooCommerce. يجب أن يتم تثبيت الإضافة لتتمكن من استخدام بوابة الدفع بالشكل الصحيح.

source: Your payment has failed, please try again.
ar: فشلت عملية الدفع الخاصة بك، يرجى المحاولة مرة أخرى.

source: amex
ar: أمريكان إكسبريس

source: mada
ar: مدى

source: tabby
ar: تابي

source: tamara
ar: تمارا
